#Пользователь вводит 3 числа, сказать сколько из них положительных
#и сколько отрицательных#
first = int(input())
second = int(input())
third = int(input())
pol = 0
otr = 0

print(pol, "положительных", otr, "отрицательных")