#Пользователь вводит 3 числа, сказать сколько из них положительных
#и сколько отрицательных#
#a = int(input())
#b = int(input())
# = int(input())
#some_list = [a, b, c]
#some_list.count('-')
#some_list.append('-')
#print(some_list)
#s = "5007175"
#print(s.replace(s[2:], '***'))
L = list(123,'spam',1.23,'tfdr')
print(len(L))